app/Http/Controllers/AdminTransaksiController.php

    public function index()
    {
        $data = [
            'title' => 'Monitoring Produk',
            'transaksi' => Transaksi::paginate(10),
            'content' => 'admin.transaksi.index',
        ];
---
select * from `transaksi` limit 10 offset 0
select count(*) as aggregate from `transaksi`

    public function create()
    {
        // $this->addTransaksi();
        $id_produk = request('id');
        $p_detail = Produk::find($id_produk);
        $id_transaksi = request('id');

        // $detail_transaksi = DetailTransaksi::whereTransaksiId($id);

        $act = request('act');
        $qty = request('qty');
        if ($act == 'min') {
            if ($qty <= 1) {
                $qty = 1;
            } else {
                $qty = $qty - 1;
            }
        } else {
            $qty = $qty + 1;
        }

        $subtotal = 0;
        if ($p_detail) {
            $subtotal = $qty * $p_detail->harga;
        }

        $transaksi = Transaksi::first();
---
select * from `produk` where `produk`.`id` is null limit 1
select * from `transaksi` limit 1

        $dibayarkan = request('dibayarkan');
        $kembalian = $dibayarkan - $transaksi->total;

        $data = [
            'title' => 'Tambah Transaksi',
            'transaksi' => $transaksi,
            'produk' => Produk::get(),
            'p_detail' => $p_detail,
            'qty' => $qty,
            'subtotal' => $subtotal,
            'detail_transaksi' => DetailTransaksi::get(),
            'kembalian' => $kembalian,
            'content' => 'admin.transaksi.create',
        ];
---
select * from `detail_transaksi` limit 1
select * from `produk`
select * from `transaksi`

    protected function addTransaksi()
    {
        $data = [
            'id_user' => auth()->user()->id,
            'nama_kasir' => auth()->user()->name,
            'total' => 0,
        ];

        Transaksi::create($data);
---
insert into `transaksi` (`id_user`, `nama_kasir`, `total`, `updated_at`, `created_at`) values (1, 'Marc Spector', 0, '2023-11-21 07:10:19', '2023-11-21 07:10:19')