app/Http/Controllers/DetailTransaksiController.php

    public function store(Request $request)
    {
        $id_transaksi = $request->id_transaksi;
        $id_produk = $request->id_produk;

        $transaksi = Transaksi::find($id_transaksi);
        $detail_transaksi = DetailTransaksi::whereIdProduk($id_produk)->whereIdTransaksi($id_transaksi)->first();

        if ($detail_transaksi == null) {
            $data = [
                'id_transaksi' => $id_transaksi,
                'id_produk' => $id_produk,
                'nama_produk' => $request->nama_produk,
                'qty' => $request->qty,
                'subtotal' => $request->subtotal,
            ];

            DetailTransaksi::create($data);

            $dt = [
                'total' => $request->subtotal + $transaksi->total,
            ];

            $transaksi->update($dt);
        } else {
            $data = [
                'qty' => $detail_transaksi->qty + $request->qty,
                'subtotal' => $detail_transaksi->subtotal + $request->subtotal,
            ];

            $detail_transaksi->update($data);
---
select * from `transaksi` where `transaksi`.`id` = '1' limit 1
select * from `detail_transaksi` where `id_produk` is null and `id_transaksi` = '1' limit 1
insert into `detail_transaksi` (`id_transaksi`, `id_produk`, `nama_produk`, `qty`, `subtotal`, `updated_at`, `created_at`) values ('1', '1', 'Indomilk', '3', '9000', '2023-11-21 04:28:54', '2023-11-21 04:28:54')
insert into `transaksi` (`id_user`, `total`, `updated_at`, `created_at`) values (1, 0, '2023-11-22 02:53:57', '2023-11-22 02:53:57')
update `transaksi` set `total` = 43052, `transaksi`.`updated_at` = '2023-11-21 07:03:17' where `id` = 1
update `detail_transaksi` set `qty` = 15, `subtotal` = 45000, `detail_transaksi`.`updated_at` = '2023-11-21 05:13:22' where `id` = 1

                'total' => $request->subtotal + $transaksi->total,
            ];

            $transaksi->update($dt);
---
update `transaksi` set `total` = 6000, `transaksi`.`updated_at` = '2023-11-21 05:13:22' where `id` = 1