app/Http/Controllers/DetailTransaksiController.php

    public function store(Request $request)
    {
        // Validate the incoming request data
        $request->validate([
            'id_transaksi' => 'required',
            'id_produk' => 'required',
            'nama_produk' => 'required',
            'qty' => 'required|numeric|min:1',
            'subtotal' => 'required|numeric|min:0',
        ]);

        $id_transaksi = $request->id_transaksi;
        $id_produk = $request->id_produk;

        // Find or create Transaksi
        $transaksi = Transaksi::find($id_transaksi);
        if (!$transaksi) {
            $transaksi = Transaksi::create([
                'id' => $id_transaksi,
                'id_user' => auth()->user()->id,
                'total' => 0
            ]);
        }

        $detail_transaksi = DetailTransaksi::where('id_produk', $id_produk)
            ->where('id_transaksi', $id_transaksi)
            ->first();
---
select * from `detail_transaksi` where `id_produk` = '2' and `id_transaksi` = '1' limit 1

        ];

        if ($detail_transaksi == null) {
            DetailTransaksi::create($data);
---
insert into `detail_transaksi` (`id_transaksi`, `id_produk`, `nama_produk`, `qty`, `subtotal`, `updated_at`, `created_at`) values ('1', '2', 'Fres', '1', '17.000', '2023-11-22 02:53:57', '2023-11-22 02:53:57')
insert into `transaksi` (`id_user`, `subtotal`, `updated_at`, `created_at`) values (1, 153000, '2023-11-21 04:52:08', '2023-11-21 04:52:08')